reports/333-haskell.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 1.647ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.626ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.633ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.49ms    2.61ms  77.18ms   99.50%
    Req/Sec     3.51k   468.08    16.67k    88.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.28ms
 75.000%    1.80ms
 90.000%    2.24ms
 99.000%    3.03ms
 99.900%   51.55ms
 99.990%   71.68ms
 99.999%   74.82ms
100.000%   77.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.100     0.000000            1         1.00
       0.568     0.100000        49555         1.11
       0.755     0.200000        98946         1.25
       0.927     0.300000       148484         1.43
       1.099     0.400000       197820         1.67
       1.283     0.500000       247308         2.00
       1.381     0.550000       272123         2.22
       1.481     0.600000       296650         2.50
       1.585     0.650000       321384         2.86
       1.692     0.700000       346145         3.33
       1.805     0.750000       370823         4.00
       1.866     0.775000       383202         4.44
       1.929     0.800000       395646         5.00
       1.996     0.825000       407949         5.71
       2.069     0.850000       420325         6.67
       2.149     0.875000       432715         8.00
       2.193     0.887500       438958         8.89
       2.241     0.900000       445149        10.00
       2.293     0.912500       451226        11.43
       2.351     0.925000       457501        13.33
       2.415     0.937500       463615        16.00
       2.451     0.943750       466682        17.78
       2.491     0.950000       469785        20.00
       2.533     0.956250       472810        22.86
       2.583     0.962500       475960        26.67
       2.641     0.968750       478996        32.00
       2.673     0.971875       480514        35.56
       2.707     0.975000       482066        40.00
       2.747     0.978125       483587        45.71
       2.797     0.981250       485192        53.33
       2.857     0.984375       486683        64.00
       2.893     0.985938       487454        71.11
       2.935     0.987500       488239        80.00
       2.991     0.989062       489010        91.43
       3.049     0.990625       489772       106.67
       3.139     0.992188       490543       128.00
       3.205     0.992969       490931       142.22
       3.287     0.993750       491312       160.00
       3.463     0.994531       491698       182.86
       5.979     0.995313       492084       213.33
      12.271     0.996094       492470       256.00
      15.023     0.996484       492664       284.44
      18.575     0.996875       492856       320.00
      22.271     0.997266       493051       365.71
      27.647     0.997656       493243       426.67
      35.903     0.998047       493437       512.00
      39.839     0.998242       493532       568.89
      42.879     0.998437       493629       640.00
      46.079     0.998633       493727       731.43
      48.959     0.998828       493824       853.33
      52.095     0.999023       493922      1024.00
      54.303     0.999121       493968      1137.78
      56.255     0.999219       494015      1280.00
      58.527     0.999316       494064      1462.86
      60.447     0.999414       494112      1706.67
      62.559     0.999512       494160      2048.00
      63.711     0.999561       494184      2275.56
      64.831     0.999609       494208      2560.00
      65.727     0.999658       494236      2925.71
      66.751     0.999707       494259      3413.33
      67.647     0.999756       494281      4096.00
      68.159     0.999780       494294      4551.11
      68.735     0.999805       494305      5120.00
      69.631     0.999829       494318      5851.43
      70.207     0.999854       494329      6826.67
      70.911     0.999878       494341      8192.00
      71.295     0.999890       494347      9102.22
      71.679     0.999902       494354     10240.00
      72.127     0.999915       494359     11702.86
      72.383     0.999927       494366     13653.33
      72.639     0.999939       494371     16384.00
      72.831     0.999945       494376     18204.44
      72.959     0.999951       494378     20480.00
      73.215     0.999957       494382     23405.71
      73.279     0.999963       494383     27306.67
      73.791     0.999969       494386     32768.00
      73.919     0.999973       494389     36408.89
      73.919     0.999976       494389     40960.00
      73.983     0.999979       494391     46811.43
      74.303     0.999982       494392     54613.33
      74.495     0.999985       494394     65536.00
      74.687     0.999986       494395     72817.78
      74.687     0.999988       494395     81920.00
      74.815     0.999989       494396     93622.86
      75.135     0.999991       494397    109226.67
      76.095     0.999992       494398    131072.00
      76.095     0.999993       494398    145635.56
      76.095     0.999994       494398    163840.00
      76.223     0.999995       494399    187245.71
      76.223     0.999995       494399    218453.33
      76.479     0.999996       494400    262144.00
      76.479     0.999997       494400    291271.11
      76.479     0.999997       494400    327680.00
      76.479     0.999997       494400    374491.43
      76.479     0.999998       494400    436906.67
      77.247     0.999998       494401    524288.00
      77.247     1.000000       494401          inf
#[Mean    =        1.495, StdDeviation   =        2.614]
#[Max     =       77.184, Total count    =       494401]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597338 requests in 1.00m, 67.79MB read
Requests/sec:   9955.58
Transfer/sec:      1.13MB