reports/333-node.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 62.738ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 84.706ms, rate sampling interval: 56ms
  Thread calibration: mean lat.: 78.375ms, rate sampling interval: 49ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.37ms    7.61ms  89.73ms   86.54%
    Req/Sec     3.37k   826.21     9.27k    71.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.69ms
 75.000%   14.08ms
 90.000%   17.28ms
 99.000%   47.87ms
 99.900%   76.42ms
 99.990%   88.45ms
 99.999%   89.60ms
100.000%   89.79ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.226     0.000000            1         1.00
       4.407     0.100000        49524         1.11
       5.991     0.200000        99011         1.25
       7.655     0.300000       148451         1.43
       9.255     0.400000       197800         1.67
      10.695     0.500000       247283         2.00
      11.359     0.550000       272027         2.22
      12.015     0.600000       296692         2.50
      12.671     0.650000       321506         2.86
      13.359     0.700000       346343         3.33
      14.079     0.750000       370856         4.00
      14.479     0.775000       383275         4.44
      14.903     0.800000       395655         5.00
      15.367     0.825000       408127         5.71
      15.871     0.850000       420290         6.67
      16.495     0.875000       432657         8.00
      16.879     0.887500       439012         8.89
      17.279     0.900000       445058        10.00
      17.791     0.912500       451307        11.43
      18.399     0.925000       457380        13.33
      19.183     0.937500       463675        16.00
      19.647     0.943750       466739        17.78
      20.207     0.950000       469792        20.00
      20.831     0.956250       472854        22.86
      21.663     0.962500       475925        26.67
      22.687     0.968750       479045        32.00
      23.487     0.971875       480559        35.56
      25.279     0.975000       482108        40.00
      28.063     0.978125       483642        45.71
      33.023     0.981250       485194        53.33
      37.247     0.984375       486738        64.00
      39.231     0.985938       487510        71.11
      42.271     0.987500       488278        80.00
      45.183     0.989062       489050        91.43
      49.375     0.990625       489828       106.67
      52.063     0.992188       490596       128.00
      54.239     0.992969       490989       142.22
      56.127     0.993750       491372       160.00
      57.983     0.994531       491762       182.86
      60.831     0.995313       492140       213.33
      63.999     0.996094       492528       256.00
      66.111     0.996484       492728       284.44
      67.199     0.996875       492914       320.00
      68.479     0.997266       493110       365.71
      70.335     0.997656       493302       426.67
      72.063     0.998047       493493       512.00
      72.767     0.998242       493592       568.89
      73.919     0.998437       493697       640.00
      74.687     0.998633       493784       731.43
      75.647     0.998828       493880       853.33
      76.479     0.999023       493981      1024.00
      77.119     0.999121       494027      1137.78
      77.567     0.999219       494078      1280.00
      78.015     0.999316       494121      1462.86
      78.527     0.999414       494169      1706.67
      78.975     0.999512       494221      2048.00
      79.167     0.999561       494241      2275.56
      79.871     0.999609       494265      2560.00
      81.663     0.999658       494289      2925.71
      84.095     0.999707       494313      3413.33
      85.759     0.999756       494337      4096.00
      86.271     0.999780       494349      4551.11
      86.527     0.999805       494362      5120.00
      87.359     0.999829       494374      5851.43
      87.807     0.999854       494385      6826.67
      88.191     0.999878       494397      8192.00
      88.319     0.999890       494405      9102.22
      88.447     0.999902       494409     10240.00
      88.767     0.999915       494416     11702.86
      89.087     0.999927       494428     13653.33
      89.087     0.999939       494428     16384.00
      89.151     0.999945       494434     18204.44
      89.151     0.999951       494434     20480.00
      89.215     0.999957       494436     23405.71
      89.279     0.999963       494441     27306.67
      89.343     0.999969       494447     32768.00
      89.343     0.999973       494447     36408.89
      89.343     0.999976       494447     40960.00
      89.343     0.999979       494447     46811.43
      89.407     0.999982       494448     54613.33
      89.535     0.999985       494451     65536.00
      89.535     0.999986       494451     72817.78
      89.535     0.999988       494451     81920.00
      89.599     0.999989       494452     93622.86
      89.663     0.999991       494453    109226.67
      89.727     0.999992       494454    131072.00
      89.727     0.999993       494454    145635.56
      89.727     0.999994       494454    163840.00
      89.791     0.999995       494457    187245.71
      89.791     1.000000       494457          inf
#[Mean    =       11.372, StdDeviation   =        7.613]
#[Max     =       89.728, Total count    =       494457]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  590031 requests in 1.00m, 56.83MB read
  Socket errors: connect 0, read 186, write 0, timeout 0
Requests/sec:   9833.66
Transfer/sec:      0.95MB